CSI API ETABS v1
cPropFrame.GetNameList Method
 Retrieves the names of all defined frame section properties of the specified type.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName,
	eFramePropType PropType =
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	Optional PropType As eFramePropType =
) As Integer
Dim instance As cPropFrame
Dim NumberNames As Integer
Dim MyName As String()
Dim PropType As eFramePropType
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName, PropType)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName,
	eFramePropType PropType =
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        ?PropType : eFramePropType
(* Defaults:
        let _PropType = defaultArg PropType
*)
-> int
Parameters
NumberNames
Type: System.Int32
The number of frame section property names retrieved by the program.
MyName
Type: System.String[]
This is a one-dimensional array of frame section property names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames - 1) inside the program, filled with the names, and returned to the API user.
PropType (Optional)
Type: ETABSv1.eFramePropType
This optional value is one of the items in the eFramePropType enumeration.
If no value is input for PropType, names are returned for all frame section properties in the model regardless of type.
Return Value
Type: Int32
Returns zero if the names are successfully retrieved; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberNames As Integer
       Dim MyName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get frame property names
       ret = SapModel.PropFrame.GetNameList(NumberNames, MyName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace